{"meta":{"title":"Hanyu","subtitle":"","description":"","author":"Hanyu","url":"https://HanyuGao.github.io","root":"/"},"pages":[{"title":"","date":"2022-05-04T05:32:30.000Z","updated":"2022-11-10T01:55:37.365Z","comments":true,"path":"about/index.html","permalink":"https://hanyugao.github.io/about/index.html","excerpt":"","text":"I’m a Product Manager, but when I started working, I did marketing. Much data was like a swirling vortex that got me lost. I tried “surfing” on “waves” but found the issue was my “board” – the data dashboard is not easy to learn insights. Then I redesigned and proposed the analytical data layers and persuaded engineers to implement them. Then it hit my mind, why not become a PM? Then I pivoted to PM, which got me out of bed on Monday easier. Over the 8 years of experience in product management, I dedicated myself to customers&#x2F;users to see a new future out of existing software or from nowhere: I’ve created a first-of-its-kind tracker that lets 30K+ soccer players see their performance data on mobile. I’ve built an online community from scratch that increased DAU by 13%. I enjoy learning new things and connecting with people across a range of industries, so don’t hesitate to reach out if you’d like to get in touch: &#116;&#x70;&#109;&#x2e;&#108;&#111;&#x72;&#x69;&#64;&#x67;&#x6d;&#97;&#105;&#x6c;&#x2e;&#99;&#x6f;&#109;"}],"posts":[{"title":"おわり","slug":"Speechless","date":"2022-11-12T07:28:00.000Z","updated":"2022-11-12T07:48:31.534Z","comments":true,"path":"2022/11/11/Speechless/","link":"","permalink":"https://hanyugao.github.io/2022/11/11/Speechless/","excerpt":"","text":"meme 竟然可以违反法律法规","categories":[],"tags":[]},{"title":"BQ Questions","slug":"BQ-Questions","date":"2022-11-10T03:07:56.000Z","updated":"2022-11-10T03:24:32.085Z","comments":true,"path":"2022/11/09/BQ-Questions/","link":"","permalink":"https://hanyugao.github.io/2022/11/09/BQ-Questions/","excerpt":"","text":"Dive Deep Tell me about a specific metric you used to identify a need for a change in your department. Did you create the metric, or was it already available? How did this and other information influence the change? What was the outcome of this change? Tell me about a time when you were trying to understand a complex problem on your team, and you had to dig into the details to figure it out. Tell me about a situation that required you to dig deep to get to the root cause. Think Big Tell me about a time you drove adoption for your vision&#x2F;ideas. Tell me about a time when you were working on an initiative or goal and saw an opportunity to do something much bigger or better than the initial focus Be Curious Tell me about a time when you realized you needed a deeper level of subject matter expertise to do your job well. What did you do about it? What was the outcome? Is there anything you would have done differently? Tell me about a time when you didn’t know what to do next or how to solve a challenging problem Describe a time when you took on work outside of your comfort area. How did you identify what you needed to learn to be successful? How did you go about building expertise to meet your goal? Did you meet your goal? Customer Obsession Tell me about a time when you went above and beyond for a customer. Why did you do it? How did the customer respond? What was the outcome? Describe a difficult interaction you had with a customer. Customer Obsession Give me an example of a tough or critical piece of feedback you received. What was it, and what did you do about it? Tell me about a time when you had to communicate a change in direction that you","categories":[],"tags":[]},{"title":"Denial of insurance","slug":"Note of an little issue","date":"2022-07-11T23:20:58.000Z","updated":"2022-11-10T02:48:39.403Z","comments":true,"path":"2022/07/11/Note of an little issue/","link":"","permalink":"https://hanyugao.github.io/2022/07/11/Note%20of%20an%20little%20issue/","excerpt":"","text":"I’m writing this note to help someone in the same situation who finds my blog via keyword searching.I hope my information could help you there. I was confused when I received a $252 bill from OSF health care. Another letter told me, your insurance company has denied the service in whole or part of as your responsibility After thinking a while, I remembered that on 05&#x2F;14&#x2F;2022, I burnt my fingers with an oven tray one day and called Mckinley Health Center for help. Mckinley Emergency agent provided service options under my insurance coverage, and I went to Heart of Mary Medical center and received the cure. But why did my student’s insurance deny the coverage? Then I called the 24&#x2F;7 SAP number on my insurance card, 877-862-1172. The agent led me to the Student Resource at 800-767-0700, where agent Mel helped. She checked and explained patiently: OSF claimed to my insurance provider, UnitedHealthcare, but at the same time, the Mckinley portal hadn’t activated the coverage for the summer semester (05&#x2F;14&#x2F;2022 - 08&#x2F;19&#x2F;2022). Therefore, the solution is to reclaim. Mel submitted the form, and I got a document control number for OSF. Then I dialed OSF Healthcare at 309-683-6750. OSF also gave me another number for tracking their process, where I could dial 800-421-5700 to follow up, and usually, the bill should be covered in 20 business days. From receiving the letters to processing the resolution, it took me 30min, mostly waiting online within 5 calls, including 2 (&#x2F;5 calls) not helpful because of the broken phone system sometimes leading me nowhere with the instructions.","categories":[{"name":"Stories","slug":"Stories","permalink":"https://hanyugao.github.io/categories/Stories/"}],"tags":[{"name":"immigrant","slug":"immigrant","permalink":"https://hanyugao.github.io/tags/immigrant/"},{"name":"U of I","slug":"U-of-I","permalink":"https://hanyugao.github.io/tags/U-of-I/"},{"name":"UIUC","slug":"UIUC","permalink":"https://hanyugao.github.io/tags/UIUC/"},{"name":"student","slug":"student","permalink":"https://hanyugao.github.io/tags/student/"},{"name":"Diary","slug":"Diary","permalink":"https://hanyugao.github.io/tags/Diary/"}]},{"title":"NVIDIA Inventory","slug":"NVIDIA","date":"2022-01-01T23:30:37.000Z","updated":"2022-11-10T02:48:18.501Z","comments":true,"path":"2022/01/01/NVIDIA/","link":"","permalink":"https://hanyugao.github.io/2022/01/01/NVIDIA/","excerpt":"","text":"Turnover Year NVIDIA’s Turnover 2013 5.5x 2014 4.7x 2015 4.8x 2016 4.9x 2017 4.7x 2018 4.9x 2019 3.8x 2020 3.2x 2021 4.4x 2022 4.3x Companies Turnover in 2022 NVIDIA 4.3x QUALCOMM 4.5x AMD 4.7x Microsoft 21.7x Data above was from Source NVIDIA takes 84.88 average days to sell the inventory in a year, while Microsoft only takes 21.7 days. Inventory &#x2F; Operating RevenueNormally, a good inventory to revenue ratio is between 5 to 10 percent. NVIDIA’s ratio is high, suggesting a significant increase in inventory compared to the speed of sales. Year Ratio 2016 8.9% 2017 15.8% 2018 11.5% 2019 16.2% 2020 8.4% 2021 16.7% 2022 15.6% Sheet above was calculated based on Balance Sheet &amp; Income Statement data. EOQ Caculating Parameter Value Remark Working Days 300 Annual Demand 4.8M units Carrying Cost &#x2F; unit $35 * 15% Chipset Cost * Carrying cost percentage, which normally ranges from 15% - 30% Ordering Cost &#x2F; unit $500 Normally 35 to 500 dollars EOQ Result Result EOQ 30,327 unit Cycle Time 2 days","categories":[],"tags":[{"name":"Nvidia","slug":"Nvidia","permalink":"https://hanyugao.github.io/tags/Nvidia/"},{"name":"Inventory","slug":"Inventory","permalink":"https://hanyugao.github.io/tags/Inventory/"},{"name":"Supply Chain","slug":"Supply-Chain","permalink":"https://hanyugao.github.io/tags/Supply-Chain/"},{"name":"EOQ","slug":"EOQ","permalink":"https://hanyugao.github.io/tags/EOQ/"}]}],"categories":[{"name":"Stories","slug":"Stories","permalink":"https://hanyugao.github.io/categories/Stories/"}],"tags":[{"name":"immigrant","slug":"immigrant","permalink":"https://hanyugao.github.io/tags/immigrant/"},{"name":"U of I","slug":"U-of-I","permalink":"https://hanyugao.github.io/tags/U-of-I/"},{"name":"UIUC","slug":"UIUC","permalink":"https://hanyugao.github.io/tags/UIUC/"},{"name":"student","slug":"student","permalink":"https://hanyugao.github.io/tags/student/"},{"name":"Diary","slug":"Diary","permalink":"https://hanyugao.github.io/tags/Diary/"},{"name":"Nvidia","slug":"Nvidia","permalink":"https://hanyugao.github.io/tags/Nvidia/"},{"name":"Inventory","slug":"Inventory","permalink":"https://hanyugao.github.io/tags/Inventory/"},{"name":"Supply Chain","slug":"Supply-Chain","permalink":"https://hanyugao.github.io/tags/Supply-Chain/"},{"name":"EOQ","slug":"EOQ","permalink":"https://hanyugao.github.io/tags/EOQ/"}]}